
===========================================================================
report_tns
============================================================================
tns -6.47

===========================================================================
report_wns
============================================================================
wns -2.27

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.27

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.31
