###############################################################################
# Created by write_sdc
# Tue May 27 18:12:25 2025
###############################################################################
current_design top_module_project4
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name CLK -period 15.0000 [get_ports {CLK}]
set_clock_transition 0.1500 [get_clocks {CLK}]
set_clock_uncertainty 0.2500 CLK
set_propagated_clock [get_clocks {CLK}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A1_regfile[0]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A1_regfile[1]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A1_regfile[2]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A1_regfile[3]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A1_regfile[4]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A2_regfile[0]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A2_regfile[1]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A2_regfile[2]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A2_regfile[3]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A2_regfile[4]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A3_regfile[0]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A3_regfile[1]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A3_regfile[2]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A3_regfile[3]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {A3_regfile[4]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[0]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[10]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[11]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[12]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[13]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[14]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[15]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[16]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[17]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[18]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[19]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[1]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[20]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[21]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[22]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[23]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[24]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[25]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[26]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[27]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[28]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[29]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[2]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[30]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[31]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[3]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[4]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[5]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[6]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[7]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[8]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WD3_regfile[9]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {WE3_regfile}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[0]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[10]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[11]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[12]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[13]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[14]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[15]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[16]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[17]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[18]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[19]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[1]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[20]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[21]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[22]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[23]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[24]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[25]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[26]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[27]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[28]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[29]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[2]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[30]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[31]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[3]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[4]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[5]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[6]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[7]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[8]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputA_alu[9]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[0]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[10]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[11]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[12]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[13]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[14]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[15]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[16]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[17]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[18]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[19]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[1]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[20]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[21]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[22]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[23]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[24]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[25]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[26]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[27]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[28]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[29]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[2]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[30]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[31]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[3]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[4]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[5]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[6]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[7]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[8]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {inputB_alu[9]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {opcode_alu[0]}]
set_input_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {opcode_alu[1]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[0]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[10]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[11]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[12]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[13]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[14]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[15]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[16]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[17]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[18]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[19]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[1]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[20]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[21]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[22]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[23]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[24]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[25]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[26]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[27]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[28]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[29]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[2]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[30]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[31]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[3]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[4]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[5]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[6]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[7]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[8]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD1_regfile[9]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[0]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[10]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[11]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[12]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[13]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[14]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[15]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[16]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[17]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[18]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[19]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[1]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[20]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[21]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[22]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[23]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[24]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[25]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[26]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[27]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[28]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[29]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[2]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[30]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[31]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[3]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[4]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[5]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[6]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[7]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[8]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {RD2_regfile[9]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[0]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[10]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[11]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[12]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[13]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[14]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[15]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[16]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[17]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[18]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[19]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[1]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[20]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[21]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[22]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[23]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[24]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[25]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[26]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[27]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[28]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[29]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[2]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[30]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[31]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[3]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[4]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[5]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[6]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[7]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[8]}]
set_output_delay 3.0000 -clock [get_clocks {CLK}] -add_delay [get_ports {result_alu[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {RD1_regfile[31]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[30]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[29]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[28]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[27]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[26]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[25]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[24]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[23]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[22]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[21]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[20]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[19]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[18]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[17]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[16]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[15]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[14]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[13]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[12]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[11]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[10]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[9]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[8]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[7]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[6]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[5]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[4]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[3]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[2]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[1]}]
set_load -pin_load 0.0334 [get_ports {RD1_regfile[0]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[31]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[30]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[29]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[28]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[27]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[26]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[25]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[24]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[23]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[22]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[21]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[20]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[19]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[18]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[17]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[16]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[15]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[14]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[13]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[12]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[11]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[10]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[9]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[8]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[7]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[6]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[5]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[4]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[3]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[2]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[1]}]
set_load -pin_load 0.0334 [get_ports {RD2_regfile[0]}]
set_load -pin_load 0.0334 [get_ports {result_alu[31]}]
set_load -pin_load 0.0334 [get_ports {result_alu[30]}]
set_load -pin_load 0.0334 [get_ports {result_alu[29]}]
set_load -pin_load 0.0334 [get_ports {result_alu[28]}]
set_load -pin_load 0.0334 [get_ports {result_alu[27]}]
set_load -pin_load 0.0334 [get_ports {result_alu[26]}]
set_load -pin_load 0.0334 [get_ports {result_alu[25]}]
set_load -pin_load 0.0334 [get_ports {result_alu[24]}]
set_load -pin_load 0.0334 [get_ports {result_alu[23]}]
set_load -pin_load 0.0334 [get_ports {result_alu[22]}]
set_load -pin_load 0.0334 [get_ports {result_alu[21]}]
set_load -pin_load 0.0334 [get_ports {result_alu[20]}]
set_load -pin_load 0.0334 [get_ports {result_alu[19]}]
set_load -pin_load 0.0334 [get_ports {result_alu[18]}]
set_load -pin_load 0.0334 [get_ports {result_alu[17]}]
set_load -pin_load 0.0334 [get_ports {result_alu[16]}]
set_load -pin_load 0.0334 [get_ports {result_alu[15]}]
set_load -pin_load 0.0334 [get_ports {result_alu[14]}]
set_load -pin_load 0.0334 [get_ports {result_alu[13]}]
set_load -pin_load 0.0334 [get_ports {result_alu[12]}]
set_load -pin_load 0.0334 [get_ports {result_alu[11]}]
set_load -pin_load 0.0334 [get_ports {result_alu[10]}]
set_load -pin_load 0.0334 [get_ports {result_alu[9]}]
set_load -pin_load 0.0334 [get_ports {result_alu[8]}]
set_load -pin_load 0.0334 [get_ports {result_alu[7]}]
set_load -pin_load 0.0334 [get_ports {result_alu[6]}]
set_load -pin_load 0.0334 [get_ports {result_alu[5]}]
set_load -pin_load 0.0334 [get_ports {result_alu[4]}]
set_load -pin_load 0.0334 [get_ports {result_alu[3]}]
set_load -pin_load 0.0334 [get_ports {result_alu[2]}]
set_load -pin_load 0.0334 [get_ports {result_alu[1]}]
set_load -pin_load 0.0334 [get_ports {result_alu[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WE3_regfile}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1_regfile[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1_regfile[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1_regfile[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1_regfile[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A1_regfile[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2_regfile[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2_regfile[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2_regfile[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2_regfile[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A2_regfile[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3_regfile[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3_regfile[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3_regfile[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3_regfile[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A3_regfile[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WD3_regfile[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputA_alu[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputB_alu[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode_alu[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {opcode_alu[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
