
===========================================================================
report_tns
============================================================================
tns -36.02

===========================================================================
report_wns
============================================================================
wns -6.07

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.07

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.39
