
===========================================================================
report_tns
============================================================================
tns -4.53

===========================================================================
report_wns
============================================================================
wns -1.24

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.24

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.26
