
===========================================================================
report_tns
============================================================================
tns -3.41

===========================================================================
report_wns
============================================================================
wns -0.97

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -0.97

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 4.25
