###############################################################################
# Created by write_sdc
# Thu Jun  5 09:33:38 2025
###############################################################################
current_design semi_cpu_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
